; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star11 - direction
	GroundStation7 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Planet12 image0)
	(have_image Phenomenon13 image0)
	(have_image Star14 image0)
	(have_image Star15 image0)
	(have_image Planet16 image0)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (turn_to satellite0 groundstation7 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet16 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet16)
   goals met: 0 of 7
5. (take_image satellite0 planet16 instrument0 image0)
   added: (have_image planet16 image0)
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 7
7. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon13 instrument0 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 7
10. (turn_to satellite0 star14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star14)
   goals met: 3 of 7
11. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 4 of 7
12. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 4 of 7
13. (take_image satellite0 star15 instrument0 image0)
   added: (have_image star15 image0)
   goals met: 5 of 7
14. (turn_to satellite0 planet12 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet12)
   goals met: 6 of 7
15. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 7 of 7
